JayHeng/imxrt-tool-flash-algo/boards/rt600_emmc_project/flash_algo_b0_silicon/Keil_JLink/emmc/fsl_mmc.c
    if (error == kStatus_Fail)
    {
        /* Card's data bus width will be default 1 bit mode. */
        SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH1BIT);
    }

    return kStatus_Success;
}

static status_t MMC_BL_SelectBusWidth(mmc_card_t *card)
{
    assert(card);
    bool isDDR = false;
    mmc_data_bus_width_t targetBusWidth = card->userConfig.busWidth;

    switch (targetBusWidth)
    {
        case kMMC_DataBusWidth8bitDDR:
        case kMMC_DataBusWidth8bit:
            /* Test and set the data bus width for card. */
            if (kSDMMCHOST_Support8BitBusWidth != SDMMCHOST_NOT_SUPPORT)
            {
                SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH8BIT);
                if ((kStatus_Success == MMC_TestDataBusWidth(card, targetBusWidth)) &&
                    (kStatus_Success == MMC_SetDataBusWidth(card, targetBusWidth)))
                {
                    card->busWidth = targetBusWidth;
                    return kStatus_Success;
                }
                else
                {
                    return kStatus_SDMMC_SetDataBusWidthFailed;
                }
            }
            else
            {
                return kStatus_SDMMC_HostNotSupport;
            }
        case kMMC_DataBusWidth4bitDDR:
        case kMMC_DataBusWidth4bit:
            /* Test and set the data bus width for card. */
            if (kSDMMCHOST_Support4BitBusWidth != SDMMCHOST_NOT_SUPPORT)
            {
                SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH4BIT);
                if ((kStatus_Success == MMC_TestDataBusWidth(card, targetBusWidth)) &&
                    (kStatus_Success == MMC_SetDataBusWidth(card, targetBusWidth)))
                {
                    card->busWidth = targetBusWidth;
                    return kStatus_Success;
                }
                else
                {
                    return kStatus_SDMMC_SetDataBusWidthFailed;
                }
            }
            else
            {
                return kStatus_SDMMC_HostNotSupport;
            }
        case kMMC_DataBusWidth1bit: /*!< MMC data bus width is 1 bit */
        default:
            return kStatus_Success;
    }
}

static status_t MMC_SwitchHSTiming(mmc_card_t *card, uint8_t timing, uint8_t driverStrength)
{
    assert(card);

    uint8_t hsTiming = 0;

    mmc_extended_csd_config_t extendedCsdconfig;

    /* check the target driver strength support or not */
    if (((card->extendedCsd.ioDriverStrength & (1 << driverStrength)) == 0U) &&
        (card->extendedCsd.extendecCsdVersion >= kMMC_ExtendedCsdRevision17))
    {
        return kStatus_SDMMC_NotSupportYet;
    }
    /* calucate the register value */
    hsTiming = (timing & 0xF) | (uint8_t)(driverStrength << 4U);

    /* Switch to high speed timing. */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex = kMMC_ExtendedCsdIndexHighSpeedTiming;
    extendedCsdconfig.ByteValue = hsTiming;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    card->extendedCsd.highSpeedTiming = hsTiming;

    return kStatus_Success;
}

static status_t MMC_BL_SwitchToHighSpeed(mmc_card_t *card, uint32_t freq)
{
    assert(card);

    if (kStatus_Success != MMC_SwitchHSTiming(card, kMMC_HighSpeedTiming, kMMC_DriverStrength0))
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    bool isDDR = (card->userConfig.busWidth == kMMC_DataBusWidth4bitDDR) ||
                 (card->userConfig.busWidth == kMMC_DataBusWidth8bitDDR);

    if (isDDR)
    {
        /* Test procedure is not supported at DDR mode.
         * So, change the frequency at SDR mode to the same frequency of SDR mode,
         * before changing the bus width.
         */
        card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, freq / 2);
    }
    else
    {
        card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, freq);
    }

    /* config io speed and strength */
    SDMMCHOST_UPDATE_MMC_IO(card->host.base, card->userConfig.busWidth, CARD_BUS_FREQ_100MHZ1, CARD_BUS_STRENGTH_7);

    /* Set card data width, it is nessesary to config the the data bus here, to meet emmc5.0 specification,
     * when you are working in DDR mode , HS_TIMING must set before set bus width
     */
    if (MMC_BL_SelectBusWidth(card) != kStatus_Success)
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }

    /* enable DDR if needed */
    if (isDDR)
    {
        /* Update the freq*/
        card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, freq);
        SDMMCHOST_ENABLE_DDR_MODE(card->host.base, true, 0U);
    }
    card->busTiming = kMMC_HighSpeedTiming;

    return kStatus_Success;
}

static status_t MMC_BL_SwitchToNomralSpeed(mmc_card_t *card)
{
    assert(card);

    /* Check bus width config */
    if ((card->userConfig.busWidth == kMMC_DataBusWidth4bitDDR) ||
        (card->userConfig.busWidth == kMMC_DataBusWidth8bitDDR))
    {
        /* Compatibility timming only supports SDR. */
        return kStatus_SDMMC_CardNotSupport;
    }
    /* Set card data width, it is nessesary to config the the data bus here, to meet emmc5.0 specification,
     * when you are working in DDR mode , HS_TIMING must set before set bus width
     */
    if (MMC_BL_SelectBusWidth(card) != kStatus_Success)
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }

    return kStatus_Success;
}

static status_t MMC_SwitchToHighSpeed(mmc_card_t *card)
{
    assert(card);

    uint32_t freq = 0U;

    /* check VCCQ voltage supply */
    if (kSDMMCHOST_SupportV180 != SDMMCHOST_NOT_SUPPORT)
    {
        if ((card->hostVoltageWindowVCCQ != kMMC_VoltageWindow170to195) &&
            (card->extendedCsd.extendecCsdVersion > kMMC_ExtendedCsdRevision10))
        {
            SDMMCHOST_SWITCH_VOLTAGE180V(card->host.base, true);
            card->hostVoltageWindowVCCQ = kMMC_VoltageWindow170to195;
        }
    }
    else if (kSDMMCHOST_SupportV120 != SDMMCHOST_NOT_SUPPORT)
    {
        if ((card->hostVoltageWindowVCCQ != kMMC_VoltageWindow120) &&
            (card->extendedCsd.extendecCsdVersion >= kMMC_ExtendedCsdRevision16))
        {
            SDMMCHOST_SWITCH_VOLTAGE120V(card->host.base, true);
            card->hostVoltageWindowVCCQ = kMMC_VoltageWindow120;
        }
    }
    else
    {
        card->hostVoltageWindowVCCQ = kMMC_VoltageWindows270to360;
    }

    if (kStatus_Success != MMC_SwitchHSTiming(card, kMMC_HighSpeedTiming, kMMC_DriverStrength0))
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    if ((card->busWidth == kMMC_DataBusWidth4bitDDR) || (card->busWidth == kMMC_DataBusWidth8bitDDR))
    {
        freq = MMC_CLOCK_DDR52;
        SDMMCHOST_ENABLE_DDR_MODE(card->host.base, true, 0U);
    }
    else if (card->flags & kMMC_SupportHighSpeed52MHZFlag)
    {
        freq = MMC_CLOCK_52MHZ;
    }
    else if (card->flags & kMMC_SupportHighSpeed26MHZFlag)
    {
        freq = MMC_CLOCK_26MHZ;
    }
    else
    {
        freq = SDMMC_CLOCK_400KHZ;
    }

    card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, freq);
    /* config io speed and strength */
    SDMMCHOST_CONFIG_MMC_IO(CARD_BUS_FREQ_100MHZ1, CARD_BUS_STRENGTH_7);

