JayHeng/imxrt-tool-flash-algo/boards/rt600_emmc_project/flash_algo_b0_silicon/Keil_JLink/emmc/fsl_mmc.c
static status_t MMC_BL_SelectBusTiming(mmc_card_t *card)
{
    assert(card);

    bool switchHS400 = false, switchHighSpeed = false;
    uint32_t targetFreq = 0U;
    mmc_high_speed_timing_t targetTiming = card->userConfig.timing;

    switch (targetTiming)
    {
        case kMMC_HighSpeed400Timing:
        case kMMC_HighSpeed200Timing:
            return kStatus_SDMMC_NotSupportYet;
        case kMMC_HighSpeedTiming:
            /* DDR mode */
            if ((card->userConfig.busWidth == kMMC_DataBusWidth4bitDDR) ||
                (card->userConfig.busWidth == kMMC_DataBusWidth8bitDDR))
            {
                if (card->flags & (kMMC_SupportHighSpeedDDR52MHZ180V300VFlag | kMMC_SupportHighSpeedDDR52MHZ120VFlag))
                {
                    targetFreq = MMC_CLOCK_DDR52;
                    switchHighSpeed = true;
                }
            }
            else /* SDR Mode*/
            {
                if (kSDMMCHOST_SupportHighSpeed != SDMMCHOST_NOT_SUPPORT)
                {
                    if (card->flags & kMMC_SupportHighSpeed52MHZFlag)
                    {
                        targetFreq = MMC_CLOCK_52MHZ;
                        switchHighSpeed = true;
                    }
                    else if (card->flags & kMMC_SupportHighSpeed26MHZFlag)
                    {
                        targetFreq = MMC_CLOCK_26MHZ;
                        switchHighSpeed = true;
                    }
                }
                else
                {
                    return kStatus_SDMMC_HostNotSupport;
                }
            }

            /* switch to high speed */
            if (switchHighSpeed)
            {
                return MMC_BL_SwitchToHighSpeed(card, targetFreq);
            }
            else
            {
                return kStatus_SDMMC_CardNotSupport;
            }
        case kMMC_HighSpeedTimingNone:
        default:
            return MMC_BL_SwitchToNomralSpeed(card);
    }
}

static void MMC_DecodeCid(mmc_card_t *card, uint32_t *rawCid)
{
    assert(card);
    assert(rawCid);

    mmc_cid_t *cid;

    cid = &(card->cid);
    cid->manufacturerID = (uint8_t)((rawCid[3U] & 0xFF000000U) >> 24U);
    cid->applicationID = (uint16_t)((rawCid[3U] & 0xFFFF00U) >> 8U);

    cid->productName[0U] = (uint8_t)((rawCid[3U] & 0xFFU));
    cid->productName[1U] = (uint8_t)((rawCid[2U] & 0xFF000000U) >> 24U);
    cid->productName[2U] = (uint8_t)((rawCid[2U] & 0xFF0000U) >> 16U);
    cid->productName[3U] = (uint8_t)((rawCid[2U] & 0xFF00U) >> 8U);
    cid->productName[4U] = (uint8_t)((rawCid[2U] & 0xFFU));

    cid->productVersion = (uint8_t)((rawCid[1U] & 0xFF000000U) >> 24U);

    cid->productSerialNumber = (uint32_t)((rawCid[1U] & 0xFFFFFFU) << 8U);
    cid->productSerialNumber |= (uint32_t)((rawCid[0U] & 0xFF000000U) >> 24U);

    cid->manufacturerData = (uint16_t)((rawCid[0U] & 0xFFF00U) >> 8U);
}

static status_t MMC_AllSendCid(mmc_card_t *card)
{
    assert(card);
    assert(card->host.transfer);

    SDMMCHOST_TRANSFER content = { 0 };
    SDMMCHOST_COMMAND command = { 0 };

    command.index = kSDMMC_AllSendCid;
    command.argument = 0U;
    command.responseType = kCARD_ResponseTypeR2;

    content.command = &command;
    content.data = NULL;
    if (kStatus_Success == card->host.transfer(card->host.base, &content))
    {
        memcpy(card->rawCid, command.response, sizeof(card->rawCid));
        MMC_DecodeCid(card, command.response);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_SendCsd(mmc_card_t *card)
{
    assert(card);
    assert(card->host.transfer);

    SDMMCHOST_COMMAND command = { 0 };
    SDMMCHOST_TRANSFER content = { 0 };

    command.index = kSDMMC_SendCsd;
    command.argument = (card->relativeAddress << 16U);
    command.responseType = kCARD_ResponseTypeR2;

    content.command = &command;
    content.data = 0U;
    if (kStatus_Success == card->host.transfer(card->host.base, &content))
    {
        memcpy(card->rawCsd, command.response, sizeof(card->rawCsd));
        /* The response is from bit 127:8 in R2, corresponding to command.response[3][31:0] to
        command.response[0U][31:8]. */
        MMC_DecodeCsd(card, card->rawCsd);

        return kStatus_Success;
    }

    return kStatus_SDMMC_TransferFailed;
}

static status_t MMC_CheckBlockRange(mmc_card_t *card, uint32_t startBlock, uint32_t blockCount)
{
    assert(card);
    assert(blockCount);

    status_t error = kStatus_Success;
    uint32_t partitionBlocks;

    switch (card->currentPartition)
    {
        case kMMC_AccessPartitionUserAera:
        {
            partitionBlocks = card->userPartitionBlocks;
            break;
        }
        case kMMC_AccessPartitionBoot1:
        case kMMC_AccessPartitionBoot2:
        {
            /* Boot partition 1 and partition 2 have the same partition size. */
            partitionBlocks = card->bootPartitionBlocks;
            break;
        }
        case kMMC_AccessGeneralPurposePartition1:
        {
            partitionBlocks = card->generalPartitionSize[0];
            break;
        }
        case kMMC_AccessGeneralPurposePartition2:
        {
            partitionBlocks = card->generalPartitionSize[1];
            break;
        }
        case kMMC_AccessGeneralPurposePartition3:
        {
            partitionBlocks = card->generalPartitionSize[2];
            break;
        }
        case kMMC_AccessGeneralPurposePartition4:
        {
            partitionBlocks = card->generalPartitionSize[3];
            break;
        }
        default:
            error = kStatus_InvalidArgument;
            break;
    }
    /* Check if the block range accessed is within current partition's block boundary. */
    if ((error == kStatus_Success) && ((startBlock + blockCount) > partitionBlocks))
    {
        error = kStatus_InvalidArgument;
    }

    return error;
}

static status_t MMC_CheckEraseGroupRange(mmc_card_t *card, uint32_t startGroup, uint32_t endGroup)
{
    assert(card);

