JayHeng/imxrt-tool-flash-algo/boards/rt600_emmc_project/flash_algo_b0_silicon/Keil_JLink/emmc/fsl_mmc.c
    uint32_t opcode = 0U;

    if (!card->isHostReady)
    {
        return kStatus_SDMMC_HostNotReady;
    }
    /* set DATA bus width */
    SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH1BIT);
    /* Set clock to 400KHz. */
    card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, SDMMC_CLOCK_400KHZ);
    /* get host capability first */
    GET_SDMMCHOST_CAPABILITY(card->host.base, &(card->host.capability));

    /* Send CMD0 to reset the bus */
    if (kStatus_Success != MMC_GoIdle(card))
    {
        return kStatus_SDMMC_GoIdleFailed;
    }

    /* Hand-shaking with card to validata the voltage range Host first sending its expected
       information.*/
    if (kStatus_Success != MMC_SendOperationCondition(card, 0U))
    {
        return kStatus_SDMMC_HandShakeOperationConditionFailed;
    }

    /* switch the host voltage which the card can support */
    if (kStatus_Success != MMC_SwitchVoltage(card, &opcode))
    {
        return kStatus_SDMMC_HandShakeOperationConditionFailed;
    }

    /* Get host's access mode. */
    if (card->host.capability.maxBlockLength >= FSL_SDMMC_DEFAULT_BLOCK_SIZE)
    {
        opcode |= kMMC_AccessModeSector << MMC_OCR_ACCESS_MODE_SHIFT;
    }
    else
    {
        opcode |= kMMC_AccessModeByte << MMC_OCR_ACCESS_MODE_SHIFT;
    }

    if (kStatus_Success != MMC_SendOperationCondition(card, opcode))
    {
        return kStatus_SDMMC_HandShakeOperationConditionFailed;
    }

    /* Get card CID */
    if (kStatus_Success != MMC_AllSendCid(card))
    {
        return kStatus_SDMMC_AllSendCidFailed;
    }

    /* Set the card relative address */
    if (kStatus_Success != MMC_SetRelativeAddress(card))
    {
        return kStatus_SDMMC_SetRelativeAddressFailed;
    }

    /* Get the CSD register content */
    if (kStatus_Success != MMC_SendCsd(card))
    {
        return kStatus_SDMMC_SendCsdFailed;
    }

    /* Set to maximum speed in normal mode. */
    MMC_SetMaxFrequency(card);

    /* Send CMD7 with the card's relative address to place the card in transfer state. Puts current selected card in
    transfer state. */
    if (kStatus_Success != MMC_SelectCard(card, true))
    {
        return kStatus_SDMMC_SelectCardFailed;
    }

    /* Get Extended CSD register content. */
    if (kStatus_Success != MMC_SendExtendedCsd(card, NULL, 0U))
    {
        return kStatus_SDMMC_SendExtendedCsdFailed;
    }

    /* set block size */
    if (kStatus_Success != MMC_SetBlockSize(card, FSL_SDMMC_DEFAULT_BLOCK_SIZE))
    {
        return kStatus_SDMMC_SetCardBlockSizeFailed;
    }

    /* switch to host support speed mode, then switch MMC data bus width and select power class */
    if (kStatus_Success != MMC_SelectBusTiming(card))
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    /* switch power class */
    if (kStatus_Success != MMC_SetPowerClass(card))
    {
        return kStatus_SDMMC_SetPowerClassFail;
    }

    /* Set to max erase unit size */
    if (kStatus_Success != MMC_SetMaxEraseUnitSize(card))
    {
        return kStatus_SDMMC_EnableHighCapacityEraseFailed;
    }

    /* Set card default to access non-boot partition */
    card->currentPartition = kMMC_AccessPartitionUserAera;

    return kStatus_Success;
}

status_t MMC_BL_CardInit(mmc_card_t *card)
{
    assert(card);

    status_t error = kStatus_Success;
    uint32_t opcode = 0U;

    if (!card->isHostReady)
    {
        return kStatus_SDMMC_HostNotReady;
    }

    /* init the pin mux here. */
    SDMMCHOST_CONFIG_MMC_MUX(card->host.base, card->userConfig.busWidth);

    /* execute the power cycle here */

    if (card->userConfig.enablePowerCycle)
    {
        SDMMCHOST_INIT_MMC_RESET(card->host.base);

        /* card power off */
        SDMMCHOST_SET_MMC_RESET(card->host.base, card->userConfig.powerPolarity);
        /* Delay some time to make card stable. */
        SDK_DelayAtLeastUs(card->userConfig.powerDownDelay_US, SystemCoreClock);
        /* card power on */
        SDMMCHOST_SET_MMC_RESET(card->host.base, !card->userConfig.powerPolarity);
        /* Delay some time to make card stable. */
        SDK_DelayAtLeastUs(card->userConfig.powerUpDelay_US, SystemCoreClock);
    }
    if (card->userConfig.switch1V8)
    {
        SDMMCHOST_INIT_MMC_VSEL(card->host.base);
        SDMMCHOST_SWITCH_VOLTAGE180V(card->host.base, true);
    }

    /* set DATA bus width */
    SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH1BIT);
    /* Set clock to 300KHz. */
    /*
     * Note: according to spec, the maximum frequency at identification state is 400KHz. But considering clock jitter,
     * and some devices might not tolerant the frequency is higher than 400KHz, 300KHz is more compatible.
     */
    card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, SDMMC_CLOCK_300KHZ);
    /* send card active */
    SDMMCHOST_SEND_CARD_ACTIVE(card->host.base, 10000U);
    /* get host capability first */
    GET_SDMMCHOST_CAPABILITY(card->host.base, &(card->host.capability));

    /* Send CMD0 to reset the bus */
    if (kStatus_Success != MMC_GoIdle(card))
    {
        return kStatus_SDMMC_GoIdleFailed;
    }

    /* Hand-shaking with card to validata the voltage range Host first sending its expected
       information.*/
    if (kStatus_Success != MMC_BL_SendOperationCondition(card, 0U))
    {
        return kStatus_SDMMC_HandShakeOperationConditionFailed;
    }

    /* Check the access mode. */
    if (card->ocr & MMC_OCR_ACCESS_MODE_MASK)
    {
        card->flags |= kMMC_SupportHighCapacityFlag;
    }

    /* switch the host voltage which the card can support */
    // According to spec, do not switch the voltage after MMC power-up.
    // if (kStatus_Success != MMC_SwitchVoltage(card, &opcode))
    //{
    //    return kStatus_SDMMC_HandShakeOperationConditionFailed;
    //}

    /* Get host's access mode. */
    if (card->host.capability.maxBlockLength >= FSL_SDMMC_DEFAULT_BLOCK_SIZE)
    {
        opcode |= kMMC_AccessModeSector << MMC_OCR_ACCESS_MODE_SHIFT;
    }
    else
    {
        opcode |= kMMC_AccessModeByte << MMC_OCR_ACCESS_MODE_SHIFT;
    }

