JayHeng/imxrt-tool-flash-algo/boards/rt600_emmc_project/flash_algo_b0_silicon/Keil_JLink/emmc/fsl_mmc.c
    if (config->updateBootConfigProtection)
    {
        /* check and configure the boot config write protect */
        bootParameter = config->pwrBootConfigProtection | ((uint8_t)(config->premBootConfigProtection) << 4U);
        if (bootParameter != (card->extendedCsd.bootConfigProtect))
        {
            if (kStatus_Success != MMC_SetBootConfigWP(card, bootParameter))
            {
                return kStatus_SDMMC_ConfigureBootFailed;
            }
        }
        /* check and configure the boot partition write protect */
        if (card->extendedCsd.bootPartitionWP != (uint8_t)(config->bootPartitionWP))
        {
            if (kStatus_Success != MMC_SetBootPartitionWP(card, config->bootPartitionWP))
            {
                return kStatus_SDMMC_ConfigureBootFailed;
            }
        }
    }

    return kStatus_Success;
}

#if 0
status_t MMC_StartBoot(mmc_card_t *card,
                       const mmc_boot_config_t *mmcConfig,
                       uint8_t *buffer,
                       SDMMCHOST_BOOT_CONFIG *hostConfig)
{
    assert(card);
    assert(mmcConfig);
    assert(buffer);

    SDMMCHOST_COMMAND command = { 0 };
    SDMMCHOST_TRANSFER content = { 0 };
    SDMMCHOST_DATA data = { 0 };
    uint32_t tempClock = 0U;

    if (!card->isHostReady)
    {
        return kStatus_Fail;
    }

    /* send card active */
    SDMMCHOST_SEND_CARD_ACTIVE(card->host.base, 100U);
    /* config the host */
    SDMMCHOST_SETMMCBOOTCONFIG(card->host.base, hostConfig);
    /* enable MMC boot */
    SDMMCHOST_ENABLE_MMC_BOOT(card->host.base, true);

    if (mmcConfig->bootTimingMode == kMMC_BootModeSDRWithDefaultTiming)
    {
        /* Set clock to 400KHz. */
        tempClock = SDMMC_CLOCK_400KHZ;
    }
    else
    {
        /* Set clock to 52MHZ. */
        tempClock = MMC_CLOCK_52MHZ;
    }
    SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, tempClock);

    if (mmcConfig->bootTimingMode == kMMC_BootModeDDRTiming)
    {
        /* enable DDR mode */
        SDMMCHOST_ENABLE_DDR_MODE(card->host.base, true, 0U);
    }

    /* data bus remapping */
    if (mmcConfig->bootDataBusWidth == kMMC_DataBusWidth1bit)
    {
        SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH1BIT);
    }
    else if ((mmcConfig->bootDataBusWidth == kMMC_DataBusWidth4bit) ||
             (mmcConfig->bootDataBusWidth == kMMC_DataBusWidth4bitDDR))
    {
        SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH4BIT);
    }
    else
    {
        SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH8BIT);
    }

    if (kMMC_BootModeAlternative == (uint32_t)SDMMCHOST_GET_HOST_CONFIG_BOOT_MODE(hostConfig))
    {
        /* alternative boot mode */
        command.argument = 0xFFFFFFFA;
    }

    command.index = kSDMMC_GoIdleState;

    data.blockSize = SDMMCHOST_GET_HOST_CONFIG_BLOCK_SIZE(hostConfig);
    data.blockCount = SDMMCHOST_GET_HOST_CONFIG_BLOCK_COUNT(hostConfig);
    data.rxData = (uint32_t *)buffer;
    SDMMCHOST_ENABLE_BOOT_FLAG(data);

    content.data = &data;
    content.command = &command;

    /* should check tuning error during every transfer*/
    if (kStatus_Success != MMC_Transfer(card, &content, 1U))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}
#endif

status_t MMC_BL_StartBoot(mmc_card_t *card, uint8_t *buffer, SDMMCHOST_BOOT_CONFIG *hostConfig)
{
    assert(card);
    assert(buffer);

    MMC_HostReset(&(card->host));
    if (MMC_HostInit(card) != kStatus_Success)
    {
        return kStatus_SDMMC_HostNotReady;
    }

    SDMMCHOST_COMMAND command = { 0 };
    SDMMCHOST_TRANSFER content = { 0 };
    SDMMCHOST_DATA data = { 0 };
    uint32_t tempClock = 0U;

    if (!card->isHostReady)
    {
        return kStatus_Fail;
    }

    /* init the pin mux here. */
    SDMMCHOST_CONFIG_MMC_MUX(card->host.base, card->userConfig.busWidth);

    /* execute the power cycle here */
    if (card->userConfig.enablePowerCycle)
    {
        SDMMCHOST_INIT_MMC_RESET(card->host.base);

        /* card power off */
        SDMMCHOST_SET_MMC_RESET(card->host.base, card->userConfig.powerPolarity);
        /* Delay some time to make card stable. */
        SDK_DelayAtLeastUs(card->userConfig.powerDownDelay_US, SystemCoreClock);
        /* card power on */
        SDMMCHOST_SET_MMC_RESET(card->host.base, !card->userConfig.powerPolarity);
        /* Delay some time to make card stable. */
        SDK_DelayAtLeastUs(card->userConfig.powerUpDelay_US, SystemCoreClock);
    }
    if (card->userConfig.switch1V8)
    {
        SDMMCHOST_INIT_MMC_VSEL(card->host.base);
        SDMMCHOST_SWITCH_VOLTAGE180V(card->host.base, true);
    }

    /* Set clock to 300KHz. */
    /*
     * Note: according to spec, the maximum frequency at identification state is 400KHz. But considering clock jitter,
     * and some devices might not tolerant the frequency is higher than 400KHz, 300KHz is more compatible.
     */
    card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, SDMMC_CLOCK_300KHZ);

    if (!card->userConfig.noPreIdle)
    {
        /* send card active */
        SDMMCHOST_SEND_CARD_ACTIVE(card->host.base, 10000U);
        /* Send CMD0 to reset the bus */
        if (kStatus_Success != MMC_GoPreIdle(card))
        {
            return kStatus_SDMMC_GoIdleFailed;
        }
    }
    /* config the host */
    SDMMCHOST_SETMMCBOOTCONFIG(card->host.base, hostConfig);
    /* enable MMC boot */
    SDMMCHOST_ENABLE_MMC_BOOT(card->host.base, true);

    bool isDDR = (card->userConfig.busWidth == kMMC_DataBusWidth4bitDDR) ||
                 (card->userConfig.busWidth == kMMC_DataBusWidth8bitDDR);

    if (card->userConfig.timing == kMMC_HighSpeedTimingNone)
    {
        if (!isDDR)
        {
            /* Set clock to 26MHz. */
            /* Note: eMMC4.0,4.1,4.2 don't support fastboot, so the max freq is 26MHz at the compatible timing*/
            tempClock = MMC_CLOCK_26MHZ;
        }
        else
        {
            /* Set clock to 26MHz.(Divide 2 for DDR) */
            /* Note: DDR mode is not supporte at the compatible timing.
             * Considering, user might want to run fastboot at a lower speed, not return failure here.
             * User still needs to set the high speed timing bit in eMMC.
             */
            tempClock = MMC_CLOCK_26MHZ * 2;
        }
    }
    else if (card->userConfig.timing == kMMC_HighSpeedTiming)
    {
        /* Set clock to 52MHZ. */
        if (!isDDR)
        {
            tempClock = MMC_CLOCK_52MHZ;
        }
        else
        {
            tempClock = MMC_CLOCK_DDR52;
        }
    }
    else
    {
        return kStatus_SDMMC_NotSupportYet;
    }
    card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, tempClock);

    if (isDDR)
    {
        SDMMCHOST_ENABLE_DDR_MODE(card->host.base, true, 0U);
    }

    /* data bus setting */
    switch (card->userConfig.busWidth)
    {
        case kMMC_DataBusWidth8bitDDR:
        case kMMC_DataBusWidth8bit:
            /* Set the data bus width for card. */
            SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH8BIT);
            break;
        case kMMC_DataBusWidth4bitDDR:
        case kMMC_DataBusWidth4bit:
            /* Set the data bus width for card. */
            SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH4BIT);
            break;
        case kMMC_DataBusWidth1bit: /*!< MMC data bus width is 1 bit */
        default:
            SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH1BIT);
            break;
    }

    if (kMMC_BootModeAlternative == (uint32_t)SDMMCHOST_GET_HOST_CONFIG_BOOT_MODE(hostConfig))
    {
        /* alternative boot mode */
        command.argument = 0xFFFFFFFA;
    }

    command.index = kSDMMC_GoIdleState;

    data.blockSize = SDMMCHOST_GET_HOST_CONFIG_BLOCK_SIZE(hostConfig);
    data.blockCount = SDMMCHOST_GET_HOST_CONFIG_BLOCK_COUNT(hostConfig);
    data.rxData = (uint32_t *)buffer;
    SDMMCHOST_ENABLE_BOOT_FLAG(data);

    content.data = &data;
    content.command = &command;

    /* should check tuning error during every transfer*/
    if (kStatus_Success != MMC_Transfer(card, &content, 1U))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

status_t MMC_ReadBootData(mmc_card_t *card, uint8_t *buffer, SDMMCHOST_BOOT_CONFIG *hostConfig)
{
    assert(card);
    assert(buffer);

    SDMMCHOST_COMMAND command = { 0 };
    SDMMCHOST_TRANSFER content = { 0 };
    SDMMCHOST_DATA data = { 0 };

    /* enable MMC boot */
    SDMMCHOST_ENABLE_MMC_BOOT(card->host.base, true);
    /* config the host */
    SDMMCHOST_SETMMCBOOTCONFIG(card->host.base, hostConfig);
    data.blockSize = SDMMCHOST_GET_HOST_CONFIG_BLOCK_SIZE(hostConfig);
    data.blockCount = SDMMCHOST_GET_HOST_CONFIG_BLOCK_COUNT(hostConfig);
    data.rxData = (uint32_t *)buffer;
    SDMMCHOST_ENABLE_BOOT_CONTINOUS_FLAG(data);
    /* no command should be send out  */
    SDMMCHOST_EMPTY_CMD_FLAG(command);

    content.data = &data;
    content.command = &command;

    /* should check tuning error during every transfer*/
    if (kStatus_Success != MMC_Transfer(card, &content, 1U))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

status_t MMC_StopBoot(mmc_card_t *card, uint32_t bootMode)
{
    assert(card);
    /* Disable boot mode */
    if (kMMC_BootModeAlternative == bootMode)
    {
        /* Send CMD0 to reset the bus */
        if (kStatus_Success != MMC_GoIdle(card))
        {
            return kStatus_SDMMC_GoIdleFailed;
        }
    }
    /* disable MMC boot */
    SDMMCHOST_ENABLE_MMC_BOOT(card->host.base, false);

    return kStatus_Success;
}
